package com.sheep.microserver.common.core.enums;


/**
 * @author yangyangSheep
 * @ClassName ErrorCodeEnum.java
 * @Description 错误码
 * @createTime 2021/5/17 20:00
 */
public enum ErrorCodeEnum {


    /** 参数错误!错误参数:  */
    PC1001(1001, "参数错误!错误参数: "),
    /** 微服务调用异常.   */
    PC1002(1002, "微服务调用异常. "),

    /** 您的账号不存在,请联系管理员. */
    PC10020(100120, "您的调休余额不足."),
    /** 该审批单流程已完结，请刷新后再操作. */
    PC10021(100121, "该审批单流程已完结，请刷新后再操作."),
    /** 该审批单流程已完结，请刷新后再操作. */
    PC10022(100122, "该次不需要补卡或者补卡流程正在进行中."),
    /** 不在打卡时间范围内. */
    PC10023(100123, "不在打卡时间范围内."),
    /** 调休时间重复. */
    PC10024(100124, "您当前申请的调休时间重复."),
    /** 调休时间重复. */
    PC10025(100125, "您当前提交的日期与正在审批中或审批通过的日期冲突."),
    /** 操作成功  */
    PC100200(10200, "操作成功"),
    /** 未知错误，请联系管理员,错误详情:  */
    PC100500(10500, "未知错误，请联系管理员,错误详情: "),



    /** 登录错误次数过多,请稍后再试.  */
    PC100011(100011, "登录错误次数过多,请稍后再试！"),
    /** 该用户不存在或密码错误!  */
    PC100012(100012, "该用户不存在或密码错误！"),
    /** 成功获取令牌 */
    PC100013(100013, "成功获取令牌！"),
    /** 账户已被禁用 */
    PC100014(100014, "账户已被禁用！"),
    /** 未登录. */
    PC100015(100015, "未登录，请先登录或联系管理员分配账户！"),
    /** 没有权限  */
    PC100016(100016, "没有访问权限！"),
    /** 您的账号已被锁定,请联系管理员.  */
    PC100017(100017, "您的账号已被锁定,请联系管理员！"),
    /** 您的账号不存在,请联系管理员. */
    PC100019(100019, "您的账号不存在,请联系管理员！"),
    /** 您的账号已过期,请联系管理员. */
    PC100020(100020, "您的账号已过期,请联系管理员！"),
    /** 您的密码已过期,请联系管理员. */
    PC100021(100021, "您的密码已过期,请联系管理员！"),
    /** 登录失败 */
    PC100030(100030, "登录失败！"),
    /** 登录失败 */
    PC100031(200, "登录成功！"),
    /** 登录失败 */
    PC100032(200, "登出成功！")




    ;

    /**
     * 错误码
     */
    private int code;
    /**
     * 错误信息
     */
    private String msg;

    public String msg() {
        return msg;
    }

    public int code() {
        return code;
    }

    ErrorCodeEnum(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }
}
